In [24]:
import pandas as pd

Vytvoření DataFrames

In [25]:
# Vytvoření DataFrame 'mazlicci'
mazlicci = pd.DataFrame({
    'mazlicek_id': [1, 2, 3, 4],
    'jmeno': ['Rex', 'Mia', 'Oreo', 'Bella'],
    'typ': ['Pes', 'Kočka', 'Pes', 'Kočka'],
    'vek': [5, 3, 2, 4]
})

# Vytvoření DataFrame 'hracky'
hracky = pd.DataFrame({
    'hracka_id': ['H1', 'H2', 'H3', 'H4'],
    'nazev_hracky': ['Kost', 'Pískací myš', 'Lanové hračky', 'Míček'],
    'mazlicek_id': [1, 2, 1, 4],
    'cena': [200, 150, 300, 100]
})

# Vytvoření DataFrame 'prodeje'
prodeje = pd.DataFrame({
    'prodej_id': [101, 102, 103, 104],
    'hracka_id': ['H1', 'H2', 'H3', 'H1'],
    'datum': ['2023-01-15', '2023-01-17', '2023-01-18', '2023-01-19'],
    'mnozstvi': [2, 1, 1, 3]
})

Spojíme tabulky mazlicci a hracky, abychom zjistili, které hračky mají které mazlíčky.

In [26]:
# Inner Join
merged_df = pd.merge(mazlicci, hracky, on='mazlicek_id', how='inner')
merged_df

   mazlicek_id  jmeno    typ  vek hracka_id   nazev_hracky  cena
0            1    Rex    Pes    5        H1           Kost   200
1            1    Rex    Pes    5        H3  Lanové hračky   300
2            2    Mia  Kočka    3        H2    Pískací myš   150
3            4  Bella  Kočka    4        H4          Míček   100

Spojíme tabulky mazlicci a hracky, abychom viděli všechny mazlíčky a jejich hračky, i když nějaký mazlíček hračku nemá.

In [27]:
# Left Join
left_joined_df = pd.merge(mazlicci, hracky, on='mazlicek_id', how='left')
left_joined_df

   mazlicek_id  jmeno    typ  vek hracka_id   nazev_hracky   cena
0            1    Rex    Pes    5        H1           Kost  200.0
1            1    Rex    Pes    5        H3  Lanové hračky  300.0
2            2    Mia  Kočka    3        H2    Pískací myš  150.0
3            3   Oreo    Pes    2       NaN            NaN    NaN
4            4  Bella  Kočka    4        H4          Míček  100.0

Spočítáme celkovou cenu hraček podle typu mazlíčka.

In [28]:
grouped_df = merged_df.groupby('typ')['cena'].sum().reset_index()
grouped_df

     typ  cena
0  Kočka   250
1    Pes   500

Spočítáme průměrnou a celkovou cenu hraček pro každý typ mazlíčka.

In [29]:
agg_df = merged_df.groupby('typ')['cena'].agg(['mean', 'sum']).reset_index()
agg_df

     typ   mean  sum
0  Kočka  125.0  250
1    Pes  250.0  500

Spočítáme celkové množství prodaných hraček a celkové tržby (cena * množství) podle mazlíčků.

In [36]:
prodeje

   prodej_id hracka_id       datum  mnozstvi
0        101        H1  2023-01-15         2
1        102        H2  2023-01-17         1
2        103        H3  2023-01-18         1
3        104        H1  2023-01-19         3

In [37]:
# Spojení tabulek hracky a prodeje
hracky_prodeje = pd.merge(hracky, prodeje, on='hracka_id', how='inner')

# Spojení s tabulkou mazlicci
mazlicci_hracky_prodeje = pd.merge(
    mazlicci, hracky_prodeje, on='mazlicek_id', how='inner')

# Výpočet celkové tržby
mazlicci_hracky_prodeje['trzby'] = mazlicci_hracky_prodeje['cena'] *  mazlicci_hracky_prodeje['mnozstvi']

# Agregace podle jména mazlíčka
agg_df = mazlicci_hracky_prodeje.groupby(
    'jmeno')[['mnozstvi', 'trzby']].sum().reset_index()
agg_df

  jmeno  mnozstvi  trzby
0   Mia         1    150
1   Rex         6   1300